Revit 2027 API
BuiltInFailures.DividedPathFailures.DividedPathLayoutStepFailed Property
 Layout algorithm failed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedPathLayoutStepFailed { get; }
Public Shared ReadOnly Property DividedPathLayoutStepFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedPathLayoutStepFailed {
	FailureDefinitionId^ get ();
}
static member DividedPathLayoutStepFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedPathFailures Class
Autodesk.Revit.DB Namespace